app/views/gossips/index.html.erb

      <a style="color: #781D47; " class="card-title" href="http://localhost:3000/gossips/<%=t.id%>"> <%=t.title %></a>
      <p class="card-text"> <% a = t.user_id %> Gossipeur : <%= @user.find(a).first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]