app/views/gossips/show.html.erb

      <p><strong>Gossip : </strong><%= @gossip.find(params[:id]).content%></p>
      <footer class="blockquote-footer"><strong>Autheur :</strong> <% g = @gossip.find(params[:id]) %> <% h = g.user_id %> <%= @user.find(h).first_name%> <%= @user.find(h).last_name%> <cite title="Source Title"><strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]


<% if current_user && (session[:user_id] == @gossip.find(params[:id]).user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]