app/helpers/sessions_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
     def current_user

        if session[:user_id]
          # même chose que hier
          current_user = User.find_by(id: session[:user_id])