app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index

    @cityy = City.all

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users"
---
  def show

    @city = City.find(params[:id])
    @gossip = Gossip.all
    @user = User.all