app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    @gossip = Gossip.all

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lou "], ["content", "Dis moi que c'est Lou qui écriiiiit"], ["user_id", 14], ["created_at", "2019-10-31 14:11:49.292769"], ["updated_at", "2019-10-31 14:11:49.292769"]]
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
    @gossip = Gossip.new(user_id: session[:user_id], title: params[:title], content: params[:content])

    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def edit
    # Méthode qui récupère le potin concerné et l'envoie à la view edit (edit.html.erb) pour affichage dans un formulaire d'édition
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Lou veut modifier"], ["content", "Lou a t elle modifée ? "], ["updated_at", "2019-10-31 14:12:58.142070"], ["id", 15]]
---
  def update
    # Méthode qui met à jour le potin à partir du contenu du formulaire de edit.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params
    # Une fois la modification faite, on redirige généralement vers la méthode show (pour afficher le potin modifié)

    @gossippp = Gossip.find(params[:id])

      unless compare_user(session[:user_id], @gossippp.user_id) == false

        if @gossippp.update(title: params[:title], content: params[:content])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 15]]
---
  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
    @gossipp = Gossip.find(params[:id])

    unless compare_user(session[:user_id], @gossipp.user_id) == false

      if @gossipp.destroy