app/controllers/gossips_controller.rb

  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
    @gossipp = Gossip.find(params[:id])
      if @gossipp.destroy
---
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 32]]